import numpy as np
import math

# 输入数据
cities = ['重庆', '成都', '自贡', '泸州', '德阳', '绵阳', '遂宁', '内江', '乐山', '南充', '眉山', '宜宾', '广安', '达州', '雅安', '资阳']
num_cities = len(cities)

# 已知的权重数据
w1 = np.array([0.91791, 0.55599, 0.07870, 0.11524, 0.07677, 0.14989, 0.05082, 0.04994, 0.19741, 0.14835, 0.08020, 0.18741, 0.07398, 0.09815, 0.12549, 0.0])
w2 = np.array([0.25128, 0.21052, 0.03707, 0.04411, 0.03490, 0.04830, 0.02826, 0.02681, 0.05507, 0.04541, 0.03851, 0.05679, 0.02984, 0.03286, 0.04384, 0.01643])

fenmu = 0

for i in range(len(cities)):
    fenmu += math.sqrt(w1[i] * w2[i])

for i in range(len(cities)):
    # print(f"{cities[i]} 的文化建设指数为: {(math.sqrt(w1[i] * w2[i]) + 0.01)/fenmu:.5f}")
    print(f"{(math.sqrt(w1[i] * w2[i])+0.001)/fenmu:.5f}")
